// src/data/booksData.js

const booksData = [
  {
    id: 1,
    title: "Кобзар",
    author: "Тарас Шевченко",
    genre: "Поезія",
    year: 1840,
    description: "Збірка поетичних творів Тараса Григоровича Шевченка, що стала символом української літератури та національної ідентичності.",
    // Змінюємо URL на локальний шлях:
    coverImageUrl: "/images/kobzar.png" // Зверни увагу на розширення .png, якщо воно таке
  },
  {
    id: 2,
    title: "Тигролови",
    author: "Іван Багряний",
    genre: "Пригодницький роман",
    year: 1944,
    description: "Роман про трагічну долю української молодої людини в умовах сталінського терору, про боротьбу за свободу та людську гідність.",
    // Змінюємо URL на локальний шлях:
    coverImageUrl: "/images/tygrolovy.jpg" 
  },
  {
    id: 3,
    title: "Захар Беркут",
    author: "Іван Франко",
    genre: "Історична повість",
    year: 1883,
    description: "Історична повість про боротьбу карпатських горян проти монголо-татарської навали у XIII столітті.",
    // Змінюємо URL на локальний шлях:
    coverImageUrl: "/images/zakhar_berkut.jpg"
  },
  {
    id: 4,
    title: "Лісова пісня",
    author: "Леся Українка",
    genre: "Драма-феєрія",
    year: 1911,
    description: "Драматичний твір, що оспівує красу природи, кохання та боротьбу за вільне, духовне життя.",
    coverImageUrl: "/images/lisova_pisnia.jpg"
  },
];

export default booksData;